//////////////////////////////////////////
////         杭州红树伟业      ///////////
///   http://shop36538723.taobao.com /////
///                                  ////
///     感谢野火提供的库文件          ///
///           2015-4-10               ///
//////////////////////////////////////////

#ifndef __K60_TOWER_H__
#define __K60_TOWER_H__

#include "mcg.h"

/*************************************************************************
*                             野火嵌入式开发工作室
*
*  功能说明：定义 printf函数 的 串口输出端口 和 串口信息
*  备    注：
*************************************************************************/
#define FIRE_PORT           UART1
#define FIRE_BAUD           115200

/*************************************************************************
*                             野火嵌入式开发工作室
*
*  功能说明：定义芯片型号
*  备    注：
*************************************************************************/
#define CPU_MK60N512VMD100



/*************************************************************************
*                             野火嵌入式开发工作室
*
*  功能说明：定义时钟频率
*  备    注：如果 MCG_CLK_MHZ 定义为 PLLUSR ，则初始化系统时用下面的自定义因子
*************************************************************************/
//#define NO_PLL_INIT
#define K60_CLK             1           // 使用外部时钟参考源
#define REF_CLK             XTAL8       // 没用到，但一些宏定义需要它

#define MCG_CLK_MHZ         PLL180// 设置时钟频率 PLL200
#define MAX_BUS_CLK         100 //80        // bus不要超过200M，这里设为100M  50
#define MAX_FLASH_CLK       30  //30      // flash不能超过32M，这里设为不超过30M

/*********************   自定义 时钟频率 分频因子   ********************/
#include "Fire_kinetis_MCG_CFG.h"   //参考这文件可以 选配 PRDIV、VDIV 。定义MCG分频因子 ：
#define PRDIV             11        // MCG_CLK_MHZ = 50u/(PRDIV+1)*(VDIV+24)
#define VDIV              31  //31
#define CORE_DIV          0         //  core = mcg/ ( CORE_DIV  + 1 )
#define BUS_DIV           4         //  bus  = mcg/ ( BUS_DIV   + 1 )
#define FLEX_DIV          4         //  flex = mcg/ ( FLEX_DIV  + 1 )
#define FLASH_DIV         9         //  flash= mcg/ ( FLASH_DIV + 1 )
/***********************************************************************/





#endif /* __K60_TOWER_H__ */
