//////////////////////////////////////////
////         杭州红树伟业      ///////////
///   http://shop36538723.taobao.com /////
///                                  ////
///     感谢野火提供的库文件          ///
///           2015-4-10               ///
//////////////////////////////////////////

#include  "delay.h"


/*************************************************************************
*                             岱默科技DEMOK Kinetis开发小组
*
*  函数名称：delay
*  功能说明：延时函数（不准确）
*  参数说明：无
*  函数返回：无
*
*************************************************************************/
void  delay(void)
{
    delayms(500);
}

/*************************************************************************
*                             岱默科技DEMOK Kinetis开发小组
*
*  函数名称：delayms
*  功能说明：延时函数（不准确），内核频率为100M时较为准确
*  参数说明：无
*  函数返回：无
*
*************************************************************************/
void  delayms(uint32  ms)
{

    uint32  i, j;
    for(i = 0; i < ms; i++)
    {
        for(j = bus_clk_khz; j > 0; j--)
        {
            asm("nop");
        }
    }
}
